import { Bold } from "lucide-react";

const mathData = [
  {
    id: 1,
    type: "algebra",
    title: "1. Числа та дії",
    subtopics: [
      {
        title: "1.1 Типи чисел",
        contentBlocks: [
          {
            type: "image",
            src: "../images/math/algebra/1.png",
            alt: "Типи чисел",
            className: "image"
          }
        ]
      },
      {
        title: "1.2 Ознаки подільності натуральних чисел",
        contentBlocks: [
          {
            type: "table",
            headers: ["", "Ознака", "Приклади"],
            rows: [
              ["на 2", "Остатня цифра числа ділиться на 2.", "...2; ...0; ...6;"],
              ["на 3", "Сума цифр числа ділиться на 3.", "123; 576; 987;"],
              ["на 4", "Дві останні цифри числа утворюють число, яке ділиться на 4.", "...64; ...00;"],
              ["на 5", "Цифри 5 чи 0 є останньою цифрою числа.", "...0; ...5;"],
              ["на 6", "У числа є ознаки подільності на 2 та на 3.", "576; 216; 78;"],
              ["на 8", "Три останні цифри числа утворюють число, яке ділиться на 8.", "...232; ...784;"],
              ["на 9", "Сума цифр числа ділиться на 9.", "549; 252; 8721;"],
              ["на 10", "Цифра 0 є останньою цифрою числа.", "...0;"],
            ]
          }
        ]
      },
      {
        title: "1.3 Ряд простих чисел",
        contentBlocks: [
          {
            type: "text",
            text: [
              { value: "Ряд протих чисел: ", bold: true },
              { value: "2; 3; 5; 7; 11; 13; 17; 19; 23; 29; 31; 37; 41; 43; 47; 53; 59; 61; 67; 71; 73; 79; 83; 89; 97; 101; 103; 107; 109; 113; 127; 131; 137; 139; 149; 151; 157; 163; 167; 173; 179; 181; 191; 193; 197; 199; 211; 223; 227; 229; 233; 239; 241; 251; 257; 263; 269; 271; 277; 281; 283; 293; 307; 311; 313; 317; 331; 337; 347; 349; 353; 359; 367; 373; 379; 383; 389; 397; 401; 409; 419; 421; 431; 433; 439; 443; 449; 457; 461; 463; 467; 479; 487; 491; 499; 503; 509; 521; 523; 541; 547; 557; 563; 569; 571; 577; 587; 593; 599; 601; 607; 613; 617; 619; 631; 641; 643; 647; 653; 659; 661; 673; 677; 683; 691; 701; 709; 719; 727; 733; 739; 743; 751; 757; 761; 769; 773; 787; 797; 809; 811; 821; 823; 827; 829; 839; 853; 857; 859; 863; 877; 881; 883; 887; 907; 911; 919; 929; 937; 941; 947; 953; 967; 971; 977; 983; 991; 997; ..." }
            ]
          }
        ]
      },
     

      
    ]
  },
  {
    id: 2,
    type: "arithmetic",
    title: "Ознаки подільності",
    subtopics: [
      {
        title: "Таблиця ознак",
        contentBlocks: [
          {
            type: "table",
            headers: ["Число", "Ознака", "Приклад"],
            rows: [
              ["2", "Остання цифра парна", "124, 786"],
              ["3", "Сума цифр ділиться на 3", "123, 576"],
              ["5", "Остання цифра 0 або 5", "35, 120"]
            ]
          }
        ]
      }
    ]
  }
];

export default mathData;