import { Bold } from "lucide-react";

const mathData = [
  {
    id: 1,
    type: "algebra",
    title: "1. Числа та дії",
    subtopics: [
      {
        title: "1.1 Типи чисел",
        contentBlocks: [
          {
            type: "image",
            src: "../images/math/algebra/1.png",
            alt: "Типи чисел",
            className: "image"
          }
        ]
      },
      {
        title: "1.2 Ознаки подільності натуральних чисел",
        contentBlocks: [
          {
            type: "table",
            headers: ["", "Ознака", "Приклади"],
            rows: [
              ["на 2", "Остатня цифра числа ділиться на 2.", "...2; ...0; ...6;"],
              ["на 3", "Сума цифр числа ділиться на 3.", "123; 576; 987;"],
              ["на 4", "Дві останні цифри числа утворюють число, яке ділиться на 4.", "...64; ...00;"],
              ["на 5", "Цифри 5 чи 0 є останньою цифрою числа.", "...0; ...5;"],
              ["на 6", "У числа є ознаки подільності на 2 та на 3.", "576; 216; 78;"],
              ["на 8", "Три останні цифри числа утворюють число, яке ділиться на 8.", "...232; ...784;"],
              ["на 9", "Сума цифр числа ділиться на 9.", "549; 252; 8721;"],
              ["на 10", "Цифра 0 є останньою цифрою числа.", "...0;"],
            ]
          }
        ]
      },
      {
        title: "1.3 Ряд простих чисел",
        contentBlocks: [
          {
            type: "text",
            text: [
              { value: "Ряд протих чисел: ", bold: true },
              { value: "2; 3; 5; 7; 11; 13; 17; 19; 23; 29; 31; 37; 41; 43; 47; 53; 59; 61; 67; 71; 73; 79; 83; 89; 97; 101; 103; 107; 109; 113; 127; 131; 137; 139; 149; 151; 157; 163; 167; 173; 179; 181; 191; 193; 197; 199; 211; 223; 227; 229; 233; 239; 241; 251; 257; 263; 269; 271; 277; 281; 283; 293; 307; 311; 313; 317; 331; 337; 347; 349; 353; 359; 367; 373; 379; 383; 389; 397; 401; 409; 419; 421; 431; 433; 439; 443; 449; 457; 461; 463; 467; 479; 487; 491; 499; 503; 509; 521; 523; 541; 547; 557; 563; 569; 571; 577; 587; 593; 599; 601; 607; 613; 617; 619; 631; 641; 643; 647; 653; 659; 661; 673; 677; 683; 691; 701; 709; 719; 727; 733; 739; 743; 751; 757; 761; 769; 773; 787; 797; 809; 811; 821; 823; 827; 829; 839; 853; 857; 859; 863; 877; 881; 883; 887; 907; 911; 919; 929; 937; 941; 947; 953; 967; 971; 977; 983; 991; 997; ..." }
            ]
          }
        ]
      },
      {
        title: "1.4 Порядок дій у виразі",
        contentBlocks: [
          {
            type: "table",
            headers: ["Ступінь", "Дії"],
            rows: [
              [
                { bold: true, value: "IV", style: { verticalAlign: "middle" } },
                {
                  value: [
                    {
                      type: "math",
                      value: "(...); \\sqrt[...]{...}; (...)^{...}; \\log_{...}{...}; \\sin(...); \\cos(...); tg(...); ctg(...); |...|; \\dots",
                    },
                  ],
                },
              ],
              [
                { bold: true, value: "III", style: { verticalAlign: "middle" } },
                {
                  value: [
                    {
                      type: "math",
                      value: "\\sqrt[a]{b}; (a)^b; \\log_a b; \\sin(a); \\cos(a); tg(a); ctg(a); |a|;",
                    },
                  ],
                },
              ],
              [
                { bold: true, value: "II", style: { verticalAlign: "middle" } },
                {
                  value: [
                    {
                      type: "math",
                      value: "... : ...; \\frac{a}{b};",
                    },
                  ],
                },
              ],
              [
                { bold: true, value: "I", style: { verticalAlign: "middle" } },
                {
                  value: [
                    {
                      type: "math",
                      value: "+; -;",
                    },
                  ],
                },
              ],
            ],
          },
        ],
      },
      {
        title: "1.5 Властивості додавання",
        contentBlocks: [
          {
            type: "list",
            ordered: true,
            items: [
              {
                value: [
                  { type: "math", value: "a+b=b+a" },
                  " – переставна властивість",
                ],
              },
              {
                value: [
                  { type: "math", value: "(a+b)+c=a+(b+c)" },
                  " – сполучна властивість",
                ],
              },
              {
                value: [
                  { type: "math", value: "a+0=a" },
                  " – властивість нуля",
                ],
              },
              {
                value: [
                  { type: "math", value: "a+(-a)=0" },
                  " – властивість протилежних чисел",
                ],
              },
            ],
          },
        ],
      },
      {
        title: "1.6 Властивості множення",
        contentBlocks: [
          {
            type: "list",
            ordered: true,
            items: [
              {
                value: [
                  { type: "math", value: "a \\cdot b = b \\cdot a" },
                  " – переставна властивість",
                ],
              },
              {
                value: [
                  { type: "math", value: "(a \\cdot b) \\cdot c = a \\cdot (b \\cdot c)" },
                  " – сполучна властивість",
                ],
              },
              {
                value: [
                  { type: "math", value: "(a+b) \\cdot c = a \\cdot c + b \\cdot c" },
                  " – розподільна властивість",
                ],
              },
              {
                value: [
                  { type: "math", value: "a \\cdot 0 = 0" },
                  " – властивість нуля",
                ],
              },
              {
                value: [
                  { type: "math", value: "a \\cdot 1 = a" },
                  " – властивість одиниці",
                ],
              },
              {
                value: [
                  { type: "math", value: "a \\cdot \\frac{1}{a} = 1" },
                  " – властивість обернених чисел",
                ],
              },
            ],
          },
        ],
      },
      {
        title: "1.7 Модуль",
        contentBlocks: [
          {
            type: "formula",
            formula: "|a| = \\begin{cases} a, & \\text{якщо } a \\ge 0 \\\\ -a, & \\text{якщо } a < 0 \\end{cases}",
          },
        ],
      },
      {
        "title": "Перевір себе: Тест з теми",
        "contentBlocks": [
          {
            "type": "quiz",
            "questions": [
              {
                "question": "Яке з наведених чисел ділиться на 3, але НЕ ділиться на 9?",
                "options": [
                  "189",
                  "549",
                  "123",
                  "909"
                ],
                "correctAnswerIndex": 2
              },
              {
                "question": "Обчисліть, дотримуючись порядку дій: 10 + 4 * 2^3",
                "options": [
                  "112",
                  "42",
                  "54",
                  "104"
                ],
                "correctAnswerIndex": 1
              },
              {
                "question": "Яке з цих чисел НЕ є простим?",
                "options": [
                  "13",
                  "17",
                  "23",
                  "21"
                ],
                "correctAnswerIndex": 3
              },
              {
                "question": "Чому дорівнює вираз: |-15| + |7 - 10| ?",
                "options": [
                  "18",
                  "12",
                  "22",
                  "-18"
                ],
                "correctAnswerIndex": 0
              },
              {
                "question": "Як називається властивість a * (b + c) = a * b + a * c?",
                "options": [
                  "Сполучна",
                  "Переставна",
                  "Розподільна",
                  "Властивість одиниці"
                ],
                "correctAnswerIndex": 2
              },
              {
                "question": "Яке число ділиться на 6?",
                "options": [
                  "123",
                  "244",
                  "576",
                  "105"
                ],
                "correctAnswerIndex": 2
              },
              {
                "question": "До якої множини чисел належить -5, але НЕ належить 1/3?",
                "options": [
                  "N (Натуральні)",
                  "Z (Цілі)",
                  "Q (Раціональні)",
                  "(Ірраціональні)"
                ],
                "correctAnswerIndex": 1
              },
              {
                "question": "Який запис демонструє сполучну властивість додавання?",
                "options": [
                  "a+b=b+a",
                  "(a+b)+c=a+(b+c)",
                  "a+0=a",
                  "a+(-a)=0"
                ],
                "correctAnswerIndex": 1
              }
            ]
          }
        ]
      }
      
    ]
  }
];

export default mathData;